Revit 2027 API
ElementPhaseStatusFilter.GetPhaseStatuses Method
 Returns the phase statuses assigned to this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementOnPhaseStatus> GetPhaseStatuses()
Public Function GetPhaseStatuses As ICollection(Of ElementOnPhaseStatus)
public:
ICollection<ElementOnPhaseStatus>^ GetPhaseStatuses()
member GetPhaseStatuses : unit -> ICollection<ElementOnPhaseStatus>
Return Value
ICollection<ElementOnPhaseStatus>
 The phase statuses.
See Also
Reference
ElementPhaseStatusFilter Class
Autodesk.Revit.DB Namespace